'''
Задача 30:  Заполните массив элементами арифметической прогрессии. 
Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.
'''

num_1 = int(input("Введите первый элемент арифметической прогрессии: "))
step = int(input("Введите шаг: "))
quantity = int(input("Введите кол-во элементов: "))
for i in range(num_1, num_1+step*quantity, step):
    print(i)

